<details><summary>Digger run report at 2024-01-08 14:03:49 (UTC)</summary>
      <details><summary>Apply for <b>mileslee-nsuslab/quickstart-actions-aws#terraform_gp_2134_global_acm</b></summary>
  
```terraform
Terraform will perform the following actions:

  # aws_vpc.vpc_network will be created
  + resource "aws_vpc" "vpc_network" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.0.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = (known after apply)
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Name" = "terraform-network10"
        }
      + tags_all                             = {
          + "Name" = "terraform-network10"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
aws_vpc.vpc_network: Creating...
aws_vpc.vpc_network: Creation complete after 3s [id=vpc-025258e79a93eebc0]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.

  ```
</details>

<details><summary>Apply for <b>mileslee-nsuslab/quickstart-actions-aws#terraform_gp_2134_global_ec2</b></summary>
  
```terraform

Error: Reference to undeclared resource

  on main.tf line 27, in resource "aws_instance" "vm_instance":
  27:   subnet_id       = aws_subnet.vpc_subnet.id

A managed resource "aws_subnet" "vpc_subnet" has not been declared in the
root module.

Error: Reference to undeclared resource

  on main.tf line 28, in resource "aws_instance" "vm_instance":
  28:   security_groups = [aws_security_group.security_group.id]

A managed resource "aws_security_group" "security_group" has not been
declared in the root module.

  ```
</details>


<details><summary>Error during applying.</summary>
  exit status 1
</details>

</details>